mkj/imxrt-pacs/svd/MIMXRT1024.svd
                  <name>DIVIDE_87</name>
                  <description>mclk frequency = 1/87 * hmclk frequency</description>
                  <value>0x56</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_88</name>
                  <description>mclk frequency = 1/88 * hmclk frequency</description>
                  <value>0x57</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_89</name>
                  <description>mclk frequency = 1/89 * hmclk frequency</description>
                  <value>0x58</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_90</name>
                  <description>mclk frequency = 1/90 * hmclk frequency</description>
                  <value>0x59</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_91</name>
                  <description>mclk frequency = 1/91 * hmclk frequency</description>
                  <value>0x5A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_92</name>
                  <description>mclk frequency = 1/92 * hmclk frequency</description>
                  <value>0x5B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_93</name>
                  <description>mclk frequency = 1/93 * hmclk frequency</description>
                  <value>0x5C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_94</name>
                  <description>mclk frequency = 1/94 * hmclk frequency</description>
                  <value>0x5D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_95</name>
                  <description>mclk frequency = 1/95 * hmclk frequency</description>
                  <value>0x5E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_96</name>
                  <description>mclk frequency = 1/96 * hmclk frequency</description>
                  <value>0x5F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_97</name>
                  <description>mclk frequency = 1/97 * hmclk frequency</description>
                  <value>0x60</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_98</name>
                  <description>mclk frequency = 1/98 * hmclk frequency</description>
                  <value>0x61</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_99</name>
                  <description>mclk frequency = 1/99 * hmclk frequency</description>
                  <value>0x62</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_100</name>
                  <description>mclk frequency = 1/100 * hmclk frequency</description>
                  <value>0x63</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_101</name>
                  <description>mclk frequency = 1/101 * hmclk frequency</description>
                  <value>0x64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_102</name>
                  <description>mclk frequency = 1/102 * hmclk frequency</description>
                  <value>0x65</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_103</name>
                  <description>mclk frequency = 1/103 * hmclk frequency</description>
                  <value>0x66</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_104</name>
                  <description>mclk frequency = 1/104 * hmclk frequency</description>
                  <value>0x67</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_105</name>
                  <description>mclk frequency = 1/105 * hmclk frequency</description>
                  <value>0x68</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_106</name>
                  <description>mclk frequency = 1/106 * hmclk frequency</description>
                  <value>0x69</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_107</name>
                  <description>mclk frequency = 1/107 * hmclk frequency</description>
                  <value>0x6A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_108</name>
                  <description>mclk frequency = 1/108 * hmclk frequency</description>
                  <value>0x6B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_109</name>
                  <description>mclk frequency = 1/109 * hmclk frequency</description>
                  <value>0x6C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_110</name>
                  <description>mclk frequency = 1/110 * hmclk frequency</description>
                  <value>0x6D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_111</name>
                  <description>mclk frequency = 1/111 * hmclk frequency</description>
                  <value>0x6E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_112</name>
                  <description>mclk frequency = 1/112 * hmclk frequency</description>
                  <value>0x6F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_113</name>
                  <description>mclk frequency = 1/113 * hmclk frequency</description>
                  <value>0x70</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_114</name>
                  <description>mclk frequency = 1/114 * hmclk frequency</description>
                  <value>0x71</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_115</name>
                  <description>mclk frequency = 1/115 * hmclk frequency</description>
                  <value>0x72</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_116</name>
                  <description>mclk frequency = 1/116 * hmclk frequency</description>
                  <value>0x73</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_117</name>
                  <description>mclk frequency = 1/117 * hmclk frequency</description>
                  <value>0x74</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_118</name>
                  <description>mclk frequency = 1/118 * hmclk frequency</description>
                  <value>0x75</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_119</name>
                  <description>mclk frequency = 1/119 * hmclk frequency</description>
                  <value>0x76</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_120</name>
                  <description>mclk frequency = 1/120 * hmclk frequency</description>
                  <value>0x77</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_121</name>
                  <description>mclk frequency = 1/121 * hmclk frequency</description>
                  <value>0x78</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_122</name>
                  <description>mclk frequency = 1/122 * hmclk frequency</description>
                  <value>0x79</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_123</name>
                  <description>mclk frequency = 1/123 * hmclk frequency</description>
                  <value>0x7A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_124</name>
                  <description>mclk frequency = 1/124 * hmclk frequency</description>
                  <value>0x7B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_125</name>
                  <description>mclk frequency = 1/125 * hmclk frequency</description>
                  <value>0x7C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_126</name>
                  <description>mclk frequency = 1/126 * hmclk frequency</description>
                  <value>0x7D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_127</name>
                  <description>mclk frequency = 1/127 * hmclk frequency</description>
                  <value>0x7E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_128</name>
                  <description>mclk frequency = 1/128 * hmclk frequency</description>
                  <value>0x7F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_129</name>
                  <description>mclk frequency = 1/129 * hmclk frequency</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_130</name>
                  <description>mclk frequency = 1/130 * hmclk frequency</description>
                  <value>0x81</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_131</name>
                  <description>mclk frequency = 1/131 * hmclk frequency</description>
                  <value>0x82</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_132</name>
                  <description>mclk frequency = 1/132 * hmclk frequency</description>
                  <value>0x83</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_133</name>
                  <description>mclk frequency = 1/133 * hmclk frequency</description>
                  <value>0x84</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_134</name>
                  <description>mclk frequency = 1/134 * hmclk frequency</description>
                  <value>0x85</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_135</name>
                  <description>mclk frequency = 1/135 * hmclk frequency</description>
                  <value>0x86</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_136</name>
                  <description>mclk frequency = 1/136 * hmclk frequency</description>
                  <value>0x87</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_137</name>
                  <description>mclk frequency = 1/137 * hmclk frequency</description>
                  <value>0x88</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_138</name>
                  <description>mclk frequency = 1/138 * hmclk frequency</description>
                  <value>0x89</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_139</name>
                  <description>mclk frequency = 1/139 * hmclk frequency</description>
                  <value>0x8A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_140</name>
                  <description>mclk frequency = 1/140 * hmclk frequency</description>
                  <value>0x8B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_141</name>
                  <description>mclk frequency = 1/141 * hmclk frequency</description>
                  <value>0x8C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_142</name>
                  <description>mclk frequency = 1/142 * hmclk frequency</description>
                  <value>0x8D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_143</name>
                  <description>mclk frequency = 1/143 * hmclk frequency</description>
                  <value>0x8E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_144</name>
                  <description>mclk frequency = 1/144 * hmclk frequency</description>
                  <value>0x8F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_145</name>
                  <description>mclk frequency = 1/145 * hmclk frequency</description>
                  <value>0x90</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_146</name>
                  <description>mclk frequency = 1/146 * hmclk frequency</description>
                  <value>0x91</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_147</name>
                  <description>mclk frequency = 1/147 * hmclk frequency</description>
                  <value>0x92</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_148</name>
                  <description>mclk frequency = 1/148 * hmclk frequency</description>
                  <value>0x93</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_149</name>
                  <description>mclk frequency = 1/149 * hmclk frequency</description>
                  <value>0x94</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_150</name>
                  <description>mclk frequency = 1/150 * hmclk frequency</description>
                  <value>0x95</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_151</name>
                  <description>mclk frequency = 1/151 * hmclk frequency</description>
                  <value>0x96</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_152</name>
                  <description>mclk frequency = 1/152 * hmclk frequency</description>
                  <value>0x97</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_153</name>
                  <description>mclk frequency = 1/153 * hmclk frequency</description>
                  <value>0x98</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_154</name>
                  <description>mclk frequency = 1/154 * hmclk frequency</description>
                  <value>0x99</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_155</name>
                  <description>mclk frequency = 1/155 * hmclk frequency</description>
                  <value>0x9A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_156</name>
                  <description>mclk frequency = 1/156 * hmclk frequency</description>
                  <value>0x9B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_157</name>
                  <description>mclk frequency = 1/157 * hmclk frequency</description>
                  <value>0x9C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_158</name>
                  <description>mclk frequency = 1/158 * hmclk frequency</description>
                  <value>0x9D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_159</name>
                  <description>mclk frequency = 1/159 * hmclk frequency</description>
                  <value>0x9E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_160</name>
                  <description>mclk frequency = 1/160 * hmclk frequency</description>
                  <value>0x9F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_161</name>
                  <description>mclk frequency = 1/161 * hmclk frequency</description>
                  <value>0xA0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_162</name>
                  <description>mclk frequency = 1/162 * hmclk frequency</description>
                  <value>0xA1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_163</name>
                  <description>mclk frequency = 1/163 * hmclk frequency</description>
                  <value>0xA2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_164</name>
                  <description>mclk frequency = 1/164 * hmclk frequency</description>
                  <value>0xA3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_165</name>
                  <description>mclk frequency = 1/165 * hmclk frequency</description>
                  <value>0xA4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_166</name>
                  <description>mclk frequency = 1/166 * hmclk frequency</description>
                  <value>0xA5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_167</name>
                  <description>mclk frequency = 1/167 * hmclk frequency</description>
                  <value>0xA6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_168</name>
                  <description>mclk frequency = 1/168 * hmclk frequency</description>
                  <value>0xA7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_169</name>
                  <description>mclk frequency = 1/169 * hmclk frequency</description>
                  <value>0xA8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_170</name>
                  <description>mclk frequency = 1/170 * hmclk frequency</description>
                  <value>0xA9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_171</name>
                  <description>mclk frequency = 1/171 * hmclk frequency</description>
                  <value>0xAA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_172</name>
                  <description>mclk frequency = 1/172 * hmclk frequency</description>
                  <value>0xAB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_173</name>
                  <description>mclk frequency = 1/173 * hmclk frequency</description>
                  <value>0xAC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_174</name>
                  <description>mclk frequency = 1/174 * hmclk frequency</description>
                  <value>0xAD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_175</name>
                  <description>mclk frequency = 1/175 * hmclk frequency</description>
                  <value>0xAE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_176</name>
                  <description>mclk frequency = 1/176 * hmclk frequency</description>
                  <value>0xAF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_177</name>
                  <description>mclk frequency = 1/177 * hmclk frequency</description>
                  <value>0xB0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_178</name>
                  <description>mclk frequency = 1/178 * hmclk frequency</description>
                  <value>0xB1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_179</name>
                  <description>mclk frequency = 1/179 * hmclk frequency</description>
                  <value>0xB2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_180</name>
                  <description>mclk frequency = 1/180 * hmclk frequency</description>
                  <value>0xB3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_181</name>
                  <description>mclk frequency = 1/181 * hmclk frequency</description>
                  <value>0xB4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_182</name>
                  <description>mclk frequency = 1/182 * hmclk frequency</description>
                  <value>0xB5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_183</name>
                  <description>mclk frequency = 1/183 * hmclk frequency</description>
                  <value>0xB6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_184</name>
                  <description>mclk frequency = 1/184 * hmclk frequency</description>
                  <value>0xB7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_185</name>
                  <description>mclk frequency = 1/185 * hmclk frequency</description>
                  <value>0xB8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_186</name>
                  <description>mclk frequency = 1/186 * hmclk frequency</description>
                  <value>0xB9</value>
                </enumeratedValue>
                <enumeratedValue>
