mkj/imxrt-pacs/svd/MIMXRT1024.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PMU</name>
      <description>PMU</description>
      <alternatePeripheral>CCM_ANALOG</alternatePeripheral>
      <groupName>PMU</groupName>
      <prependToName>PMU_</prependToName>
      <baseAddress>0x400D8000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x180</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PMU</name>
        <value>61</value>
      </interrupt>
      <registers>
        <register>
          <name>REG_1P1</name>
          <description>Regulator 1P1 Register</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1073</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENABLE_LINREG</name>
              <description>Control bit to enable the regulator output.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_BO</name>
              <description>Control bit to enable the brownout circuitry in the regulator.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_ILIMIT</name>
              <description>Control bit to enable the current-limit circuitry in the regulator.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_PULLDOWN</name>
              <description>Control bit to enable the pull-down circuitry in the regulator</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BO_OFFSET</name>
              <description>Control bits to adjust the regulator brownout offset voltage in 25mV steps</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_TRG</name>
              <description>Control bits to adjust the regulator output voltage</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OUTPUT_TRG_4</name>
                  <description>0.8V</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTPUT_TRG_16</name>
                  <description>1.1V</description>
                  <value>0x10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BO_VDD1P1</name>
              <description>Status bit that signals when a brownout is detected on the regulator output.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OK_VDD1P1</name>
              <description>Status bit that signals when the regulator output is ok. 1 = regulator output &gt; brownout target</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENABLE_WEAK_LINREG</name>
              <description>Enables the weak 1p1 regulator</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SELREF_WEAK_LINREG</name>
              <description>Selects the source for the reference voltage of the weak 1p1 regulator.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELREF_WEAK_LINREG_0</name>
                  <description>Weak-linreg output tracks low-power-bandgap voltage</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELREF_WEAK_LINREG_1</name>
                  <description>Weak-linreg output tracks VDD_SOC_IN voltage</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_1P1_SET</name>
          <description>Regulator 1P1 Register</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1073</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENABLE_LINREG</name>
              <description>Control bit to enable the regulator output.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_BO</name>
              <description>Control bit to enable the brownout circuitry in the regulator.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_ILIMIT</name>
              <description>Control bit to enable the current-limit circuitry in the regulator.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_PULLDOWN</name>
              <description>Control bit to enable the pull-down circuitry in the regulator</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BO_OFFSET</name>
              <description>Control bits to adjust the regulator brownout offset voltage in 25mV steps</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_TRG</name>
              <description>Control bits to adjust the regulator output voltage</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OUTPUT_TRG_4</name>
                  <description>0.8V</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTPUT_TRG_16</name>
                  <description>1.1V</description>
                  <value>0x10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BO_VDD1P1</name>
              <description>Status bit that signals when a brownout is detected on the regulator output.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OK_VDD1P1</name>
              <description>Status bit that signals when the regulator output is ok. 1 = regulator output &gt; brownout target</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENABLE_WEAK_LINREG</name>
              <description>Enables the weak 1p1 regulator</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SELREF_WEAK_LINREG</name>
              <description>Selects the source for the reference voltage of the weak 1p1 regulator.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELREF_WEAK_LINREG_0</name>
                  <description>Weak-linreg output tracks low-power-bandgap voltage</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELREF_WEAK_LINREG_1</name>
                  <description>Weak-linreg output tracks VDD_SOC_IN voltage</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_1P1_CLR</name>
          <description>Regulator 1P1 Register</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1073</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENABLE_LINREG</name>
              <description>Control bit to enable the regulator output.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_BO</name>
              <description>Control bit to enable the brownout circuitry in the regulator.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_ILIMIT</name>
              <description>Control bit to enable the current-limit circuitry in the regulator.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_PULLDOWN</name>
              <description>Control bit to enable the pull-down circuitry in the regulator</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BO_OFFSET</name>
              <description>Control bits to adjust the regulator brownout offset voltage in 25mV steps</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_TRG</name>
              <description>Control bits to adjust the regulator output voltage</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OUTPUT_TRG_4</name>
                  <description>0.8V</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTPUT_TRG_16</name>
                  <description>1.1V</description>
                  <value>0x10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BO_VDD1P1</name>
              <description>Status bit that signals when a brownout is detected on the regulator output.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OK_VDD1P1</name>
              <description>Status bit that signals when the regulator output is ok. 1 = regulator output &gt; brownout target</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENABLE_WEAK_LINREG</name>
              <description>Enables the weak 1p1 regulator</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SELREF_WEAK_LINREG</name>
              <description>Selects the source for the reference voltage of the weak 1p1 regulator.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELREF_WEAK_LINREG_0</name>
                  <description>Weak-linreg output tracks low-power-bandgap voltage</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELREF_WEAK_LINREG_1</name>
                  <description>Weak-linreg output tracks VDD_SOC_IN voltage</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_1P1_TOG</name>
          <description>Regulator 1P1 Register</description>
          <addressOffset>0x11C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1073</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENABLE_LINREG</name>
              <description>Control bit to enable the regulator output.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_BO</name>
              <description>Control bit to enable the brownout circuitry in the regulator.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_ILIMIT</name>
              <description>Control bit to enable the current-limit circuitry in the regulator.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_PULLDOWN</name>
              <description>Control bit to enable the pull-down circuitry in the regulator</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BO_OFFSET</name>
              <description>Control bits to adjust the regulator brownout offset voltage in 25mV steps</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_TRG</name>
              <description>Control bits to adjust the regulator output voltage</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OUTPUT_TRG_4</name>
                  <description>0.8V</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTPUT_TRG_16</name>
                  <description>1.1V</description>
                  <value>0x10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BO_VDD1P1</name>
              <description>Status bit that signals when a brownout is detected on the regulator output.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OK_VDD1P1</name>
              <description>Status bit that signals when the regulator output is ok. 1 = regulator output &gt; brownout target</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENABLE_WEAK_LINREG</name>
              <description>Enables the weak 1p1 regulator</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SELREF_WEAK_LINREG</name>
              <description>Selects the source for the reference voltage of the weak 1p1 regulator.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELREF_WEAK_LINREG_0</name>
                  <description>Weak-linreg output tracks low-power-bandgap voltage</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELREF_WEAK_LINREG_1</name>
                  <description>Weak-linreg output tracks VDD_SOC_IN voltage</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_3P0</name>
          <description>Regulator 3P0 Register</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF74</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENABLE_LINREG</name>
              <description>Control bit to enable the regulator output to be set by the programmed target voltage setting and internal bandgap reference</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_BO</name>
              <description>Control bit to enable the brownout circuitry in the regulator.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_ILIMIT</name>
              <description>Control bit to enable the current-limit circuitry in the regulator.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BO_OFFSET</name>
              <description>Control bits to adjust the regulator brownout offset voltage in 25mV steps</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VBUS_SEL</name>
              <description>Select input voltage source for LDO_3P0 from either USB_OTG1_VBUS or USB_OTG2_VBUS</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_OTG2_VBUS</name>
                  <description>Utilize VBUS OTG2 power</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_OTG1_VBUS</name>
                  <description>Utilize VBUS OTG1 power</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTPUT_TRG</name>
              <description>Control bits to adjust the regulator output voltage</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OUTPUT_TRG_0</name>
                  <description>2.625V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTPUT_TRG_15</name>
                  <description>3.000V</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTPUT_TRG_31</name>
                  <description>3.400V</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BO_VDD3P0</name>
              <description>Status bit that signals when a brownout is detected on the regulator output.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OK_VDD3P0</name>
              <description>Status bit that signals when the regulator output is ok. 1 = regulator output &gt; brownout target</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
