mkj/imxrt-pacs/svd/MIMXRT1024.svd
        <register>
          <name>HPCONTROL0</name>
          <description>HPCONTROL0 register</description>
          <addressOffset>0x358</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HPC_DMA</name>
              <description>Indicates the privilege/user mode for the eDMA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HPC_DMA_0</name>
                  <description>User mode for the corresponding master</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPC_DMA_1</name>
                  <description>Supervisor mode for the corresponding master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L_DMA</name>
              <description>Lock bit set by the TZ software for the eDMA</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L_DMA_0</name>
                  <description>No lock-the adjacent (next lower) bit can be written by the software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L_DMA_1</name>
                  <description>Lock-the adjacent (next lower) bit can't be written by the software.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HPC_LCDIF</name>
              <description>Indicates the privilege/user mode for the LCDIF</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HPC_LCDIF_0</name>
                  <description>User mode for the corresponding master</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPC_LCDIF_1</name>
                  <description>Supervisor mode for the corresponding master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L_LCDIF</name>
              <description>Lock bit set by the TZ software for the LCDIF</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L_LCDIF_0</name>
                  <description>No lock-the adjacent (next lower) bit can be written by the software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L_LCDIF_1</name>
                  <description>Lock-the adjacent (next lower) bit can't be written by the software.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HPC_CSI</name>
              <description>Indicates the privilege/user mode for the CSI</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HPC_CSI_0</name>
                  <description>User mode for the corresponding master</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPC_CSI_1</name>
                  <description>Supervisor mode for the corresponding master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L_CSI</name>
              <description>Lock bit set by the TZ software for the CSI</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L_CSI_0</name>
                  <description>No lock-the adjacent (next lower) bit can be written by the software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L_CSI_1</name>
                  <description>Lock-the adjacent (next lower) bit can't be written by the software.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HPC_PXP</name>
              <description>Indicates the privilege/user mode for the PXP</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HPC_PXP_0</name>
                  <description>User mode for the corresponding master</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPC_PXP_1</name>
                  <description>Supervisor mode for the corresponding master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L_PXP</name>
              <description>Lock bit set by the TZ software for the PXP</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L_PXP_0</name>
                  <description>No lock-the adjacent (next lower) bit can be written by the software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L_PXP_1</name>
                  <description>Lock-the adjacent (next lower) bit can't be written by the software.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HPC_DCP</name>
              <description>Indicates the privilege/user mode for the DCP</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HPC_DCP_0</name>
                  <description>User mode for the corresponding master</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPC_DCP_1</name>
                  <description>Supervisor mode for the corresponding master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L_DCP</name>
              <description>Lock bit set by the TZ software for the DCP</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L_DCP_0</name>
                  <description>No lock-the adjacent (next lower) bit can be written by the software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L_DCP_1</name>
                  <description>Lock-the adjacent (next lower) bit can't be written by the software.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HPC_ENET</name>
              <description>Indicates the privilege/user mode for the ENET</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HPC_ENET_0</name>
                  <description>User mode for the corresponding master</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPC_ENET_1</name>
                  <description>Supervisor mode for the corresponding master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L_ENET</name>
              <description>Lock bit set by the TZ software for the ENET</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L_ENET_0</name>
                  <description>No lock-the adjacent (next lower) bit can be written by the software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L_ENET_1</name>
                  <description>Lock-the adjacent (next lower) bit can't be written by the software.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HPC_USDHC1</name>
              <description>Indicates the privilege/user mode for the USDHC1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HPC_USDHC1_0</name>
                  <description>User mode for the corresponding master</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPC_USDHC1_1</name>
                  <description>Supervisor mode for the corresponding master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L_USDHC1</name>
              <description>Lock bit set by the TZ software for the USDHC1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L_USDHC1_0</name>
                  <description>No lock-the adjacent (next lower) bit can be written by the software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L_USDHC1_1</name>
                  <description>Lock-the adjacent (next lower) bit can't be written by the software.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HPC_USDHC2</name>
              <description>Indicates the privilege/user mode for the USDHC2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HPC_USDHC2_0</name>
                  <description>User mode for the corresponding master</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPC_USDHC2_1</name>
                  <description>Supervisor mode for the corresponding master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L_USDHC2</name>
              <description>Lock bit set by the TZ software for the USDHC2.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L_USDHC2_0</name>
                  <description>No lock-the adjacent (next lower) bit can be written by the software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L_USDHC2_1</name>
                  <description>Lock-the adjacent (next lower) bit can't be written by the software.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HPC_TPSMP</name>
              <description>Indicates the privilege/user mode for the TPSMP</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HPC_TPSMP_0</name>
                  <description>User mode for the corresponding master</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPC_TPSMP_1</name>
                  <description>Supervisor mode for the corresponding master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L_TPSMP</name>
              <description>Lock bit set by the TZ software for the TPSMP.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L_TPSMP_0</name>
                  <description>No lock-the adjacent (next lower) bit can be written by the software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L_TPSMP_1</name>
                  <description>Lock-the adjacent (next lower) bit can't be written by the software.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HPC_USB</name>
              <description>Indicates the privilege/user mode for the USB</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HPC_USB_0</name>
                  <description>User mode for the corresponding master</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPC_USB_1</name>
                  <description>Supervisor mode for the corresponding master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L_USB</name>
              <description>Lock bit set by the TZ software for the USB.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L_USB_0</name>
                  <description>No lock-the adjacent (next lower) bit can be written by the software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L_USB_1</name>
                  <description>Lock-the adjacent (next lower) bit can't be written by the software.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
