mkj/imxrt-pacs/svd/MIMXRT1024.svd
        <register>
          <name>CLPCR</name>
          <description>CCM Low Power Control Register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x79</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPM</name>
              <description>Setting the low power mode that system will enter on next assertion of dsm_request signal.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPM_0</name>
                  <description>Remain in run mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_1</name>
                  <description>Transfer to wait mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_2</name>
                  <description>Transfer to stop mode</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ARM_CLK_DIS_ON_LPM</name>
              <description>Define if Arm clocks (arm_clk, soc_mxclk, soc_pclk, soc_dbg_pclk, vl_wrck) will be disabled on wait mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARM_CLK_DIS_ON_LPM_0</name>
                  <description>Arm clock enabled on wait mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARM_CLK_DIS_ON_LPM_1</name>
                  <description>Arm clock disabled on wait mode. .</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SBYOS</name>
              <description>Standby clock oscillator bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SBYOS_0</name>
                  <description>On-chip oscillator will not be powered down, after next entrance to STOP mode. (CCM_REF_EN_B will remain asserted - '0' and cosc_pwrdown will remain de asserted - '0')</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SBYOS_1</name>
                  <description>On-chip oscillator will be powered down, after next entrance to STOP mode. (CCM_REF_EN_B will be deasserted - '1' and cosc_pwrdown will be asserted - '1'). When returning from STOP mode, external oscillator will be enabled again, on-chip oscillator will return to oscillator mode, and after oscnt count, CCM will continue with the exit from the STOP mode process.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIS_REF_OSC</name>
              <description>dis_ref_osc - in run mode, software can manually control closing of external reference oscillator clock, i</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS_REF_OSC_0</name>
                  <description>external high frequency oscillator will be enabled, i.e. CCM_REF_EN_B = '0'.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS_REF_OSC_1</name>
                  <description>external high frequency oscillator will be disabled, i.e. CCM_REF_EN_B = '1'</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VSTBY</name>
              <description>Voltage standby request bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VSTBY_0</name>
                  <description>Voltage will not be changed to standby voltage after next entrance to STOP mode. ( PMIC_STBY_REQ will remain negated - '0')</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSTBY_1</name>
                  <description>Voltage will be requested to change to standby voltage after next entrance to stop mode. ( PMIC_STBY_REQ will be asserted - '1').</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STBY_COUNT</name>
              <description>Standby counter definition</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STBY_COUNT_0</name>
                  <description>CCM will wait (1*pmic_delay_scaler)+1 ckil clock cycles</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STBY_COUNT_1</name>
                  <description>CCM will wait (3*pmic_delay_scaler)+1 ckil clock cycles</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STBY_COUNT_2</name>
                  <description>CCM will wait (7*pmic_delay_scaler)+1 ckil clock cycles</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STBY_COUNT_3</name>
                  <description>CCM will wait (15*pmic_delay_scaler)+1 ckil clock cycles</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COSC_PWRDOWN</name>
              <description>In run mode, software can manually control powering down of on chip oscillator, i</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COSC_PWRDOWN_0</name>
                  <description>On chip oscillator will not be powered down, i.e. cosc_pwrdown = '0'.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COSC_PWRDOWN_1</name>
                  <description>On chip oscillator will be powered down, i.e. cosc_pwrdown = '1'.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BYPASS_LPM_HS1</name>
              <description>Bypass low power mode handshake. This bit should always be set to 1'b1 by software.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_LPM_HS0</name>
              <description>Bypass low power mode handshake. This bit should always be set to 1'b1 by software.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_CORE0_WFI</name>
              <description>Mask WFI of core0 for entering low power mode Assertion of all bits[27:22] will generate low power mode request</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK_CORE0_WFI_0</name>
                  <description>WFI of core0 is not masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASK_CORE0_WFI_1</name>
                  <description>WFI of core0 is masked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASK_SCU_IDLE</name>
              <description>Mask SCU IDLE for entering low power mode Assertion of all bits[27:22] will generate low power mode request</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK_SCU_IDLE_0</name>
                  <description>SCU IDLE is not masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASK_SCU_IDLE_1</name>
                  <description>SCU IDLE is masked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASK_L2CC_IDLE</name>
              <description>Mask L2CC IDLE for entering low power mode</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK_L2CC_IDLE_0</name>
                  <description>L2CC IDLE is not masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASK_L2CC_IDLE_1</name>
                  <description>L2CC IDLE is masked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CISR</name>
          <description>CCM Interrupt Status Register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>LRF_PLL</name>
              <description>CCM interrupt request 2 generated due to lock of all enabled and not bypaseed PLLs</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LRF_PLL_0</name>
                  <description>interrupt is not generated due to lock ready of all enabled and not bypaseed PLLs</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LRF_PLL_1</name>
                  <description>interrupt generated due to lock ready of all enabled and not bypaseed PLLs</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COSC_READY</name>
              <description>CCM interrupt request 2 generated due to on board oscillator ready, i</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COSC_READY_0</name>
                  <description>interrupt is not generated due to on board oscillator ready</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COSC_READY_1</name>
                  <description>interrupt generated due to on board oscillator ready</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEMC_PODF_LOADED</name>
              <description>CCM interrupt request 1 generated due to frequency change of semc_podf</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEMC_PODF_LOADED_0</name>
                  <description>interrupt is not generated due to frequency change of semc_podf</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEMC_PODF_LOADED_1</name>
                  <description>interrupt generated due to frequency change of semc_podf</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PERIPH2_CLK_SEL_LOADED</name>
              <description>CCM interrupt request 1 generated due to frequency change of periph2_clk_sel</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PERIPH2_CLK_SEL_LOADED_0</name>
                  <description>interrupt is not generated due to frequency change of periph2_clk_sel</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERIPH2_CLK_SEL_LOADED_1</name>
                  <description>interrupt generated due to frequency change of periph2_clk_sel</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHB_PODF_LOADED</name>
              <description>CCM interrupt request 1 generated due to frequency change of ahb_podf</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AHB_PODF_LOADED_0</name>
                  <description>interrupt is not generated due to frequency change of ahb_podf</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB_PODF_LOADED_1</name>
                  <description>interrupt generated due to frequency change of ahb_podf</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PERIPH_CLK_SEL_LOADED</name>
              <description>CCM interrupt request 1 generated due to update of periph_clk_sel.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PERIPH_CLK_SEL_LOADED_0</name>
                  <description>interrupt is not generated due to update of periph_clk_sel.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERIPH_CLK_SEL_LOADED_1</name>
                  <description>interrupt generated due to update of periph_clk_sel.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ARM_PODF_LOADED</name>
              <description>CCM interrupt request 1 generated due to frequency change of arm_podf</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARM_PODF_LOADED_0</name>
                  <description>interrupt is not generated due to frequency change of arm_podf</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARM_PODF_LOADED_1</name>
                  <description>interrupt generated due to frequency change of arm_podf</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
