mkj/imxrt-pacs/svd/MIMXRT1024.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="TMR1">
      <name>TMR2</name>
      <description>TMR</description>
      <groupName>TMR</groupName>
      <baseAddress>0x401E0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x7A</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TMR2</name>
        <value>134</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>GPT1</name>
      <description>GPT</description>
      <groupName>GPT</groupName>
      <prependToName>GPT1_</prependToName>
      <headerStructName>GPT</headerStructName>
      <baseAddress>0x401EC000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x28</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPT1</name>
        <value>100</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>GPT Control Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>GPT Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN_0</name>
                  <description>GPT is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_1</name>
                  <description>GPT is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENMOD</name>
              <description>GPT Enable mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENMOD_0</name>
                  <description>GPT counter will retain its value when it is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENMOD_1</name>
                  <description>GPT counter value is reset to 0 when it is disabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBGEN</name>
              <description>GPT debug mode enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DBGEN_0</name>
                  <description>GPT is disabled in debug mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBGEN_1</name>
                  <description>GPT is enabled in debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAITEN</name>
              <description>GPT Wait Mode enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WAITEN_0</name>
                  <description>GPT is disabled in wait mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAITEN_1</name>
                  <description>GPT is enabled in wait mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOZEEN</name>
              <description>GPT Doze Mode Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DOZEEN_0</name>
                  <description>GPT is disabled in doze mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DOZEEN_1</name>
                  <description>GPT is enabled in doze mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPEN</name>
              <description>GPT Stop Mode enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOPEN_0</name>
                  <description>GPT is disabled in Stop mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOPEN_1</name>
                  <description>GPT is enabled in Stop mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKSRC</name>
              <description>Clock Source select</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLKSRC_0</name>
                  <description>No clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKSRC_1</name>
                  <description>Peripheral Clock (ipg_clk)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKSRC_2</name>
                  <description>High Frequency Reference Clock (ipg_clk_highfreq)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKSRC_3</name>
                  <description>External Clock</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKSRC_4</name>
                  <description>Low Frequency Reference Clock (ipg_clk_32k)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKSRC_5</name>
                  <description>Crystal oscillator as Reference Clock (ipg_clk_24M)</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRR</name>
              <description>Free-Run or Restart mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRR_0</name>
                  <description>Restart mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRR_1</name>
                  <description>Free-Run mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EN_24M</name>
              <description>Enable 24 MHz clock input from crystal</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN_24M_0</name>
                  <description>24M clock disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_24M_1</name>
                  <description>24M clock enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWR</name>
              <description>Software reset</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWR_0</name>
                  <description>GPT is not in reset state</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWR_1</name>
                  <description>GPT is in reset state</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM1</name>
              <description>See IM2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IM2</name>
              <description>IM2 (bits 19-18, Input Capture Channel 2 operating mode) IM1 (bits 17-16, Input Capture Channel 1 operating mode) The IMn bit field determines the transition on the input pin (for Input capture channel n), which will trigger a capture event</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IM2_0</name>
                  <description>capture disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IM2_1</name>
                  <description>capture on rising edge only</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IM2_2</name>
                  <description>capture on falling edge only</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IM2_3</name>
                  <description>capture on both edges</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OM1</name>
              <description>See OM3</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OM2</name>
              <description>See OM3</description>
              <bitOffset>23</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OM3</name>
              <description>OM3 (bits 28-26) controls the Output Compare Channel 3 operating mode</description>
              <bitOffset>26</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OM3_0</name>
                  <description>Output disconnected. No response on pin.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OM3_1</name>
                  <description>Toggle output pin</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OM3_2</name>
                  <description>Clear output pin</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OM3_3</name>
                  <description>Set output pin</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OM3_4</name>
                  <description>Generate an active low pulse (that is one input clock wide) on the output pin.</description>
                  <value>#1xx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FO1</name>
              <description>See F03</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FO2</name>
              <description>See F03</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FO3</name>
              <description>FO3 Force Output Compare Channel 3 FO2 Force Output Compare Channel 2 FO1 Force Output Compare Channel 1 The FOn bit causes the pin action programmed for the timer Output Compare n pin (according to the OMn bits in this register)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FO3_0</name>
                  <description>Writing a 0 has no effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FO3_1</name>
                  <description>Causes the programmed pin action on the timer Output Compare n pin; the OFn flag is not set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PR</name>
          <description>GPT Prescaler Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRESCALER</name>
              <description>Prescaler bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRESCALER_0</name>
                  <description>Divide by 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_1</name>
                  <description>Divide by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_4095</name>
                  <description>Divide by 4096</description>
                  <value>0xFFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRESCALER24M</name>
              <description>Prescaler bits</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRESCALER24M_0</name>
                  <description>Divide by 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER24M_1</name>
                  <description>Divide by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER24M_15</name>
                  <description>Divide by 16</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>GPT Status Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>OF1</name>
              <description>See OF3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>OF2</name>
              <description>See OF3</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>OF3</name>
              <description>OF3 Output Compare 3 Flag OF2 Output Compare 2 Flag OF1 Output Compare 1 Flag The OFn bit indicates that a compare event has occurred on Output Compare channel n</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OF3_0</name>
                  <description>Compare event has not occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OF3_1</name>
                  <description>Compare event has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IF1</name>
              <description>See IF2</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>IF2</name>
              <description>IF2 Input capture 2 Flag IF1 Input capture 1 Flag The IFn bit indicates that a capture event has occurred on Input Capture channel n</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IF2_0</name>
                  <description>Capture event has not occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IF2_1</name>
                  <description>Capture event has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ROV</name>
              <description>Rollover Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ROV_0</name>
                  <description>Rollover has not occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ROV_1</name>
                  <description>Rollover has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
