mkj/imxrt-pacs/svd/MIMXRT1024.svd
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_AD_B1_15</name>
          <description>SW_MUX_CTL_PAD_GPIO_AD_B1_15 SW MUX Control Register</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0</name>
                  <description>Select mux mode: ALT0 mux port: LPI2C1_SDA of instance: lpi2c1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>Select mux mode: ALT1 mux port: ACMP4_OUT of instance: cmp4</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2</name>
                  <description>Select mux mode: ALT2 mux port: LPSPI3_SDI of instance: lpspi3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3</name>
                  <description>Select mux mode: ALT3 mux port: ENET_1588_EVENT0_IN of instance: enet</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4</name>
                  <description>Select mux mode: ALT4 mux port: FLEXIO1_FLEXIO00 of instance: flexio1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5</name>
                  <description>Select mux mode: ALT5 mux port: GPIO1_IO31 of instance: gpio1</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_AD_B1_15</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_SD_B0_00</name>
          <description>SW_MUX_CTL_PAD_GPIO_SD_B0_00 SW MUX Control Register</description>
          <addressOffset>0x13C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0</name>
                  <description>Select mux mode: ALT0 mux port: USDHC1_DATA2 of instance: usdhc1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>Select mux mode: ALT1 mux port: QTIMER1_TIMER0 of instance: qtimer1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2</name>
                  <description>Select mux mode: ALT2 mux port: SAI1_MCLK of instance: sai1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3</name>
                  <description>Select mux mode: ALT3 mux port: SAI2_MCLK of instance: sai2</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4</name>
                  <description>Select mux mode: ALT4 mux port: LPI2C3_SCL of instance: lpi2c3</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5</name>
                  <description>Select mux mode: ALT5 mux port: GPIO3_IO13 of instance: gpio3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6</name>
                  <description>Select mux mode: ALT6 mux port: FLEXSPI_A_SS1_B of instance: flexspi_bus2bit</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT7</name>
                  <description>Select mux mode: ALT7 mux port: XBAR1_INOUT14 of instance: xbar1</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_SD_B0_00</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_SD_B0_01</name>
          <description>SW_MUX_CTL_PAD_GPIO_SD_B0_01 SW MUX Control Register</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0</name>
                  <description>Select mux mode: ALT0 mux port: USDHC1_DATA3 of instance: usdhc1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>Select mux mode: ALT1 mux port: QTIMER1_TIMER1 of instance: qtimer1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2</name>
                  <description>Select mux mode: ALT2 mux port: REF_24M_OUT of instance: anatop</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3</name>
                  <description>Select mux mode: ALT3 mux port: SAI2_RX_SYNC of instance: sai2</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4</name>
                  <description>Select mux mode: ALT4 mux port: LPI2C3_SDA of instance: lpi2c3</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5</name>
                  <description>Select mux mode: ALT5 mux port: GPIO3_IO14 of instance: gpio3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6</name>
                  <description>Select mux mode: ALT6 mux port: FLEXSPI_B_SS1_B of instance: flexspi_bus2bit</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT7</name>
                  <description>Select mux mode: ALT7 mux port: XBAR1_INOUT15 of instance: xbar1</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_SD_B0_01</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_SD_B0_02</name>
          <description>SW_MUX_CTL_PAD_GPIO_SD_B0_02 SW MUX Control Register</description>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0</name>
                  <description>Select mux mode: ALT0 mux port: USDHC1_CMD of instance: usdhc1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>Select mux mode: ALT1 mux port: QTIMER1_TIMER2 of instance: qtimer1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2</name>
                  <description>Select mux mode: ALT2 mux port: LPUART7_CTS_B of instance: lpuart7</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3</name>
                  <description>Select mux mode: ALT3 mux port: SAI2_RX_BCLK of instance: sai2</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4</name>
                  <description>Select mux mode: ALT4 mux port: LPSPI1_SCK of instance: lpspi1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5</name>
                  <description>Select mux mode: ALT5 mux port: GPIO3_IO15 of instance: gpio3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6</name>
                  <description>Select mux mode: ALT6 mux port: ENET_MDIO of instance: enet</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT7</name>
                  <description>Select mux mode: ALT7 mux port: XBAR1_INOUT16 of instance: xbar1</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_SD_B0_02</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_SD_B0_03</name>
          <description>SW_MUX_CTL_PAD_GPIO_SD_B0_03 SW MUX Control Register</description>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0</name>
                  <description>Select mux mode: ALT0 mux port: USDHC1_CLK of instance: usdhc1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>Select mux mode: ALT1 mux port: QTIMER1_TIMER3 of instance: qtimer1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2</name>
                  <description>Select mux mode: ALT2 mux port: LPUART7_RTS_B of instance: lpuart7</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3</name>
                  <description>Select mux mode: ALT3 mux port: SAI2_RX_DATA of instance: sai2</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4</name>
                  <description>Select mux mode: ALT4 mux port: LPSPI1_PCS0 of instance: lpspi1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5</name>
                  <description>Select mux mode: ALT5 mux port: GPIO3_IO16 of instance: gpio3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6</name>
                  <description>Select mux mode: ALT6 mux port: ENET_MDC of instance: enet</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_SD_B0_03</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_SD_B0_04</name>
          <description>SW_MUX_CTL_PAD_GPIO_SD_B0_04 SW MUX Control Register</description>
          <addressOffset>0x14C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0</name>
                  <description>Select mux mode: ALT0 mux port: USDHC1_DATA0 of instance: usdhc1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1</name>
                  <description>Select mux mode: ALT1 mux port: FLEXCAN2_TX of instance: flexcan2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2</name>
                  <description>Select mux mode: ALT2 mux port: LPUART7_TX of instance: lpuart7</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3</name>
                  <description>Select mux mode: ALT3 mux port: SAI2_TX_DATA of instance: sai2</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4</name>
                  <description>Select mux mode: ALT4 mux port: LPSPI1_SDO of instance: lpspi1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5</name>
                  <description>Select mux mode: ALT5 mux port: GPIO3_IO17 of instance: gpio3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6</name>
                  <description>Select mux mode: ALT6 mux port: FLEXSPI_B_SS0_B of instance: flexspi_bus2bit</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_SD_B0_04</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
