mkj/imxrt-pacs/svd/MIMXRT1024.svd
        <register>
          <name>SRAMCR0</name>
          <description>SRAM Control Register 0</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PS</name>
              <description>Port Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PS_0</name>
                  <description>8bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PS_1</name>
                  <description>16bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAITEN</name>
              <description>Wait Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WAITEN_0</name>
                  <description>The SEMC does not monitor wait pin.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAITEN_1</name>
                  <description>The SEMC monitors wait pin. The SEMC does not transfer/receive data when wait pin is asserted.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAITSP</name>
              <description>Wait Sample</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WAITSP_0</name>
                  <description>Wait pin is directly used by the SEMC.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAITSP_1</name>
                  <description>Wait pin is sampled by internal clock before it is used.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BL</name>
              <description>Burst Length</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BL_0</name>
                  <description>1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BL_1</name>
                  <description>2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BL_2</name>
                  <description>4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BL_3</name>
                  <description>8</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BL_4</name>
                  <description>16</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BL_5</name>
                  <description>32</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BL_6</name>
                  <description>64</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BL_7</name>
                  <description>64</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AM</name>
              <description>Address Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AM_0</name>
                  <description>Address/Data MUX mode (ADMUX)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AM_1</name>
                  <description>Advanced Address/Data MUX mode (AADM)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADVP</name>
              <description>ADV# polarity</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADVP_0</name>
                  <description>ADV# is active low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADVP_1</name>
                  <description>ADV# is active high.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COL</name>
              <description>Column Address bit width</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COL_0</name>
                  <description>12 Bits</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL_1</name>
                  <description>11 Bits</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL_2</name>
                  <description>10 Bits</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL_3</name>
                  <description>9 Bits</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL_4</name>
                  <description>8 Bits</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL_5</name>
                  <description>7 Bits</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL_6</name>
                  <description>6 Bits</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL_7</name>
                  <description>5 Bits</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL_8</name>
                  <description>4 Bits</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL_9</name>
                  <description>3 Bits</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL_10</name>
                  <description>2 Bits</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL_11</name>
                  <description>12 Bits</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL_12</name>
                  <description>12 Bits</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL_13</name>
                  <description>12 Bits</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL_14</name>
                  <description>12 Bits</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL_15</name>
                  <description>12 Bits</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAMCR1</name>
          <description>SRAM Control Register 1</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CES</name>
              <description>CE setup time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CEH</name>
              <description>CE hold time</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AS</name>
              <description>Address setup time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AH</name>
              <description>Address hold time</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WEL</name>
              <description>WE low time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WEH</name>
              <description>WE high time</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REL</name>
              <description>RE low time</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REH</name>
              <description>RE high time</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAMCR2</name>
          <description>SRAM Control Register 2</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TA</name>
              <description>Turnaround time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AWDH</name>
              <description>Address to write data hold time</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CEITV</name>
              <description>CE# interval time</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAMCR3</name>
          <description>SRAM Control Register 3</description>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DBICR0</name>
          <description>DBI-B Control Register 0</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PS</name>
              <description>Port Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PS_0</name>
                  <description>8bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PS_1</name>
                  <description>16bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BL</name>
              <description>Burst Length</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BL_0</name>
                  <description>1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BL_1</name>
                  <description>2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BL_2</name>
                  <description>4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BL_3</name>
                  <description>8</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BL_4</name>
                  <description>16</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BL_5</name>
                  <description>32</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BL_6</name>
                  <description>64</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BL_7</name>
                  <description>64</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COL</name>
              <description>Column Address bit width</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COL_0</name>
                  <description>12 Bits</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL_1</name>
                  <description>11 Bits</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL_2</name>
                  <description>10 Bits</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL_3</name>
                  <description>9 Bits</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL_4</name>
                  <description>8 Bits</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL_5</name>
                  <description>7 Bits</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL_6</name>
                  <description>6 Bits</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL_7</name>
                  <description>5 Bits</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL_8</name>
                  <description>4 Bits</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL_9</name>
                  <description>3 Bits</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL_10</name>
                  <description>2 Bits</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL_11</name>
                  <description>12 Bits</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL_12</name>
                  <description>12 Bits</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL_13</name>
                  <description>12 Bits</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL_14</name>
                  <description>12 Bits</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL_15</name>
                  <description>12 Bits</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DBICR1</name>
          <description>DBI-B Control Register 1</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CES</name>
              <description>CSX Setup Time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CEH</name>
              <description>CSX Hold Time</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WEL</name>
              <description>WRX Low Time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WEH</name>
              <description>WRX High Time</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REL</name>
              <description>RDX Low Time bit [3:0]</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REH</name>
              <description>RDX High Time bit [3:0]</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CEITV</name>
              <description>CSX interval time</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPCR0</name>
          <description>IP Command Control Register 0</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SA</name>
              <description>Slave address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
